<template>
  <div>
    <h4 class="center grey-text text-darken-3">Уровень {{ levelRender }}</h4>
    <p class="center grey-text text-darken-1" style="font-size: 1.2rem">
      {{ describeTextRender }}{{ levelRestRender }}.
    </p>
  </div>
</template>

<script>
import { mapGetters } from "vuex";
export default {
  data() {
    const describeText = [
      "На начальном уровне предалагаются простые задания на сложение/вычитание цифр. Для перехода на следующий уровень необходимо решить правильно 5 заданий подряд. Для достижения уровня 1 осталось решить заданий: ",
      "На 1-м уровне предалагаются простые задания на сложение/вычитание цифр. Для перехода на следующий уровень необходимо решить правильно 10 заданий подряд. Для достижения уровня 2 осталось решить заданий: ",
      "На 2-м уровне предалагаются задания на сложение/вычитание трех цифр. Для перехода на следующий уровень необходимо решить правильно 15 заданий подряд. Для достижения уровня 3 осталось решить заданий: ",
      "На 3-м уровне предалагаются задания на сложение/вычитание чисел со значением от 8 до 13. Для перехода на следующий уровень необходимо решить правильно 15 заданий подряд. Для достижения уровня 4 осталось решить заданий: ",
      "На 4-м уровне предалагаются задания на сложение/вычитание чисел со значением от 12 до 19. Для перехода на следующий уровень необходимо решить правильно 15 заданий подряд. Для достижения уровня 5 осталось решить заданий: ",
      "На 5-м уровне предалагаются простые задания на умножение/деление чисел. Для перехода на следующий уровень необходимо решить правильно 15 заданий подряд. Для достижения уровня 6 осталось решить заданий: ",
      "На данном уровне предалагаются различные задания на сложение/вычитание, умножение/деление чисел. Для перехода на следующий уровень необходимо решить правильно 15 заданий подряд. Для достижения следующего уровня осталось решить заданий: ",
    ];
    const levelRender = 0;
    const levelRestRender = 0;
    return {
      describeText,
      levelRender,
      levelRestRender,
    };
  },
  computed: {
    describeTextRender() {
      return this.levelRender < 6
        ? this.describeText[this.levelRender]
        : this.describeText[6];
    },
    ...mapGetters(["getInfo"]),
  },
  mounted() {
    this.levelRender = this.getInfo.subjectsRest
      ? this.getInfo.subjectsRest.math.level
      : 0;
    this.levelRestRender = this.getInfo.subjectsRest
      ? this.getInfo.subjectsRest.math.levelRest
      : 5;
  },
};
</script>

<style>
</style>